# 1. 什么是面向过程？什么是面向对象？（多行注释）
"""
面向过程
1把完成某一个需求的所有步骤从头到尾逐步实现
2根据开发需求，将某些功能独立的代码封装成一些函数
3最后完成代码，就是顺序调用不同的函数
"""
"""
面向对象
面向对象相比于面向过程是更大的封装，根据职责在一个对象中封装多个方法
1在完成某一需求前，首先确定职责---要做的事情（方法）
2根据职责确定不同的对象，在对象内部封装不同的方法（多个）
3最后完成的代码，就是顺序地让不同的对象调用不同的方法
"""
# 2. 为什么会出现面向对象的编程方式？面向对象解决了哪些问题？（多行注释）
"""
1为了应对复杂项目的开发，提供固定的套路
2有固定的开发过程，能够完成更加复杂的编程
主程序功能大大简化
不会出现函数彼此调用
"""
# 3. 什么是类？什么是对象？（多行注释）
"""
1类是抽象的，不能直接使用
2类是一个模板，负责创建对象
"""
"""
1对象是由类创建出来的一个具体存在，可以直接使用
2哪一个类创建出来的对象，就有哪一个类的属性，方法
"""
"""
先有类，再有对象
类只需要一个，对象可以有很多
同一个类中创建出来的不同对象属性可以不同
"""
# 4. 类包含哪些要素？（注意审题，不是面向对象的三要素，而是类包含的要素）
"""
类包含的三要素
1类名 这类事物的名字，满足大驼峰命名法(每一个单词的首字母都要大写，但是不需要下划线)
2属性 这类事物具有什么样的特征
3方法 这类事物具有什么样的行为
"""
"""
面向过程的三要素
封装
继承
多态
"""

# 开发前明确需要那些类
